In [1]:
import warnings
warnings.filterwarnings('ignore')
import pandas as pd

# Sample DataFrame
data = {'gender': ['male', 'female', 'male', 'female'],
        'age': [25.0, 30.0, 27.0, 32.0]}
df = pd.DataFrame(data)
df.dtypes
df.select_dtypes(include = ['object' , 'float'])[['gender' , 'age']]

   gender   age
0    male  25.0
1  female  30.0
2    male  27.0
3  female  32.0

In [2]:
df.groupby('gender')['age'].agg(['mean', 'sum', 'count']).reset_index()

   gender  mean   sum  count
0  female  31.0  62.0      2
1    male  26.0  52.0      2

In [3]:
data = {'gender': ['male', 'female', 'male', 'female'],
        'department': ['A', 'B', 'A', 'B'],
        'age': [25, 30, 27, 32],
        'salary': [50000, 60000, 55000, 65000],
        'award': [2, 3, 1, 4]}
df = pd.DataFrame(data)

df.groupby(['gender', 'department']).agg({'age':'sum',
                                  'salary':'sum',
                                  'award': 'sum'}).reset_index()

   gender department  age  salary  award
0  female          B   62  125000      7
1    male          A   52  105000      3

In [4]:
#df.groupby('department')['salary'].nlargest(2).reset_index(level=0)

df.groupby('department').apply(lambda x : x.nlargest(2, 'salary')).reset_index(drop = True)

   gender department  age  salary  award
0    male          A   27   55000      1
1    male          A   25   50000      2
2  female          B   32   65000      4
3  female          B   30   60000      3

In [5]:
fruits = ['apple', 'banana', 'apricot', 'orange', 'avocado']

new_list = [x for x in fruits if x[-1] =='e']
for i in new_list:
    print(i)

apple
orange

In [6]:
import time
def after5sec():
    time.sleep(5)
    print("Hello")
after5sec()

Hello

In [7]:
salary = [100, 200, 50, 20, 10]
new_salary = [x for x in salary if x >20 and x<200]
for i in new_salary:
    if i !=100:
        print(i)

50

In [8]:
for i in fruits:
    if i.startswith('a'):
        print(i)

apple
apricot
avocado

In [9]:
numbers = [2, 3, 4, 6, 5]
qsr_list = [x for x in numbers if x % 2==0]
for i in qsr_list:
    print(i)

2
4
6

In [10]:
countries = ["USA", "Canada", "UK", "Germany"]
capitals = ["Washington", "Ottawa", "London", "Berlin"]

new_list = [(countries,capitals) for countries, capitals in zip(countries,capitals)]
print(new_list)

[('USA', 'Washington'), ('Canada', 'Ottawa'), ('UK', 'London'), ('Germany', 'Berlin')]

In [11]:
#df.columns = [col.lower() for col in df.columns]
#df.columns = map(lambda x : x.lower(), df.columns)
#df.applymap(lambda x: x.lower() if isinstance(x, str) else x)

In [12]:
numbers = [[2, 3, 4, 6, 5],[], [1,2],[],[4,5,6,7]]
new_list = [x for x in numbers if x !=[]]
for i in new_list:
    print(i)

[2, 3, 4, 6, 5]
[1, 2]
[4, 5, 6, 7]

How do you create a dictionary using list comprehension in Python?

In [5]:
key = ['A','B','C']
value = [1,2,3]
dict = {k:v for k,v in zip(key,value)}
dict

{'A': 1, 'B': 2, 'C': 3}

In [3]:
def fibonacci(n):
    if n <= 1:
        return n
    else:
        return fibonacci(n-1) +fibonacci(n-2)
fibonacci(6)

8

In [5]:
def factorial(n):
    if n ==0:
        return 1
    else:
        return n * factorial(n-1)
factorial(5)

120